Tekla.Structures.Plugins.PluginCoordinateSystemAttribute
The PluginCoordinateSystemAttribute class is used for defining  the coordinate system type for model plug-ins which are using points as an input.
The attribute is initialized from the custom attribute [PluginCoordinateSystem(PluginBase.CoordinateSystemType Type)] in the plug-in source.
If attribute is not defined or attribute has value PluginBase.CoordinateSystemType.FROM_FIRST_POINT_AND_GLOBAL coordinate system is calculated as earlier.
The attribute is used if the first Inputdefinition object contains at least two points (defined by two points, line, face or polygon).

Tekla.Structures.Plugins.PluginCoordinateSystemAttribute.#ctor(Tekla.Structures.Plugins.PluginBase.CoordinateSystemType)
The custom attribute used to define coordinate system of the plug-in.
This is not to be used by itself.
Type: The type of the input object dependency.

Tekla.Structures.Plugins.PluginCoordinateSystemAttribute.Type
Returns the type of the input object dependency.

Tekla.Structures.Plugins.PluginCoordinateSystemAttribute.#ctor(System.Int32)
The custom attribute used to define coordinate system of the plug-in.
This is not to be used by itself.
Type: The type of the input object dependency as an integer.